Translate this code from COBOL to Java:
IDENTIFICATION DIVISION.
PROGRAM-ID. HELLO.
DATA DIVISION.
WORKING-STORAGE SECTION.
01 THE-MESSAGE      PIC X(20).
PROCEDURE DIVISION.
    DISPLAY "STARTING PROGRAM".
    MOVE "HELLO WORLD" TO THE-MESSAGE.
    DISPLAY THE-MESSAGE.
    STOP RUN.
